Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/retirement/older_people_and_working/retirement_age_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: There is no single fixed retirement age for employees
ga: Níl aon aois le dhul amach ar phinsean

source: If you are employed, your retirement age is set out in your contract of employment
ga: Má tá tú fostaithe, tá an aois le dhul amach ar phinsean leagtha síos i do chonradh fostaíochta

source: Some contracts of employment have a mandatory retirement age (that is, the age at which you must retire), but they also have provisions for earlier retirement generally and/or on grounds of illness
ga: I bhformhór conarthaí tá aois shainordaithe le dhul amach ar phinsean leagtha síos sa chonradh - ach is iondúil go mbíonn soláthar ann chun dul amach ar phinsean níos luaithe agus/nó ar bhonn tinneas

source: The usual retirement age in contracts of employment is 65
ga: Sé an gnáth aois a bhíonn leagtha síos i gconradh le dhul amach ar phinsean ná 65

source: Many have provisions for early retirement from age 60 or in some cases from age 55 and most have provision for early retirement on health grounds
ga: Bíonn soláthar i roinnt mhaith acu le dhul amach ar phinsean go luath ó aois 60 nó i roinnt cásanna ó aois 55 agus tá socruithe ag formhór acu i gcomhair dul ar phinsean luath mar gheall ar chúrsaí sláinte

source: In some cases, there is a statutory retirement age. These retirement ages arise in jobs that are established by law and the law sets out the maximum age of staff
ga: I roinnt postanna, tá aois reachtúil ann le n-éirí as an bpost - tárlaíonn sé i bpostanna atá bunaithe ag an dlí agus leagann an dlí síos an uas-aois don fhoireann oibre

source: If you are self-employed, there is no set retirement age
ga: Má tá tú féinfhostaithe, níl aon aois phinsin leagtha síos

source: There is no overall retirement age for company directors, but the company's articles of association may set a maximum age
ga: Níl aon aois phinsin ginearálta ann do stiúrthóirí comhlachtaí, ach d'fhéadfadh sé go mbeadh uas-aois leagtha síos in airteagail chomhlachais an chomhlacht

source: The mandatory retirement age is the age at which you must retire
ga: Sé an aois sainordaithe pinsean ná an aois ag a gcaithfidh tú eirí as an obair

source: It is usually set out in your contract of employment
ga: Is iondúil go mbíonn sé leagtha síos i do chonradh

source: There are still some employments where the contract of employment does not include a mandatory retirement age but they are unusual
ga: Tá roinnt postanna ann fós nach bhfuil aon aois pinsean sainordaithe sa gconradh fostaíochta, ach ní mórán acu atá ann

source: The retirement age in the public sector for people who joined it before 1 April 2004 is 65 years
ga: 65 an aois scoir san earnáil phoiblí dóibh sin a thosaigh ag obair roimh 1 Aibreán 2004

source: Some occupations - for example, the Gardai, firefighters and the Defence Forces - have provisions for much earlier retirement
ga: Ach tá aois scoir i bhfad níos luaithe ag roinnt gairmeacha - mar shampla, na Gardaí, na múchadóirí dóiteáin agus na Fórsaí Cosanta

source: The minimum retirement age is 65 for people who joined the public service after 1 April 2004
ga: Is í an aois íosta scoir 65 bliain i measc daoine a chuaigh leis an tseirbhís phoiblí i ndiaidh an 1 Aibreán 2004

source: For people who joined the public service after 1 January 2013 the minimum retirement age is 66 and the mandatory retirement age is 70
ga: I dtaobh daoine a chuaigh leis an tseirbhís phoiblí i ndiaidh an 1 Eanáir 2013, is í an aois íosta scoir 66 bliain agus is í an aois éigeantach scoir 70 bliain

source: This means that they will not have retire at age 65 or 66 but can continue working, subject to suitability and health requirements
ga: Ciallaíonn seo nach mbeidh orthu dul ar scor ag aois 65 nó 66 ach gur féidir leo leanúint ag oibriú, faoi réir oiriúnachta agus riachtanais sláinte

source: Pension benefits for new entrants to the public service will therefore accrue on a standard basis (that is, one year's credit for one year's service up to a maximum of 40 years' service)
ga: Fabhrófar sochair phinsin d’iontrálaithe nua sa tseirbhís phoiblí, ar an ábhar sin, ar bhonn caighdeánach (is é sin, creidmheas bliain amháin do sheirbhís bliain amháin a fhad le seirbhís 40 bliain, ar a mhéid)

source: The minimum retirement age is 55 for people who joined the Gardai and Fire Service after 1 April 2004, while the compulsory retirement age for Gardai is 60
ga: Is í an aois íosta scoir 55 bliain i measc daoine a chuaigh leis na Gardaí agus an tSeirbhís Dóiteáin i ndiaidh an 1 Aibreán 2004, agus is í an aois éigeantach scoir do na Gardaí 60 bliain

source: Equality legislation: Discrimination on the grounds of age for everyone aged over 16 is prohibited under employment equality legislation
ga: Reachtaíocht chomhionannais: Cuirtear cosc a chur ar leatrom ar chúiseanna aoise do gach duine os cionn 16 bliana d'aois

source: However, employers are still allowed to set minimum recruitment ages of 18 or under and to set retirement ages in employment contracts
ga: Is ceadmhach fós d’fhostóirí faoin reachtaíocht um chomhionannas fostaíochta, áfach, íos-aois earcaíochta de 18 bliana nó níos ísle a leagan síos agus aoiseanna scoir a leagan síos i gconarthaí fostaíochta

source: Since 1 January 2016, section 34 of the Employment Equality Act 1998 is amended by the Equality (Miscellaneous Provisions) Act 2015 to the effect that an employer may set a mandatory retirement age provided it is objectively justified
ga: Ó 1 Eanáir 2016, faoin Alt 34 an Achta um Chomhionannas Fostaíochta 1998 arna leasú leis an Acht Chomhionannas (Forálacha Ilghnéitheacha) 2015, is féidir le fostóir aois scoir shainordaitheach a leagan síos ar an gcoinníoll go gcosnaítear é ar bhonn tosca oibiachtúla

source: There is a statutory, (that is, set out in legislation), retirement age for some public servants
ga: Tá aois reachtúil, sé sin, aois atá leagtha síos ag an dlí, ann le dhul amach ar phinsean do roinnt státseirbhísigh

source: For people who joined the public service before 1 April 2004 this is generally 65
ga: I dtaobh daoine a chuaigh leis an tseirbhís phoiblí roimh an 1 Aibreán 2004, is gnách gurb é 65 bliain d’aois an aois reachtúil scoir

source: Since 1 January 2013, the minimum retirement age for new entrants is 66 rising to 68 in 2028 in line with the State Contributory Pension
ga: Ón 1 Eanáir 2013 i leith, is é 66 an aois íosta scoir d’iontrálaithe nua agus aois 68 a bheidh i gceist leis seo in 2028, ar aon dul leis an bPinsean Stáit (Ranníocach)

source: In general, self-employed people do not face age limits
ga: Go ginearálta, níl aon chúinsí aoise ag baint do dhaoine féinfhostaithe

source: General practitioners must retire from the General Medical Services scheme at age 70 – this is a statutory provision
ga: Caithfidh gnáthdhochtúirí éirí as an scéim Seirbhísí Ginearalta Leighis ag aois 70 - seo rial reachtúil

source: However, they may continue in private practice if they meet the fitness to practice criteria set by the Medical Council
ga: Is féidir leo, áfach leanacht ag obair i gcleachtadh príobháideach, chomh fada is a bhfuil siad ag teacht leis an gcritéir cumas gairm dochtúireachta a chleachtadh atá leagtha síos ag an gComhairle Leighis

source: There is no general age limit for company directors, but sometimes the company's articles of association may specify an upper age limit
ga: Níl aon aois pinsean ginearálta ann do stiúrthóirí comhlachtaí, ach d'fhéadfadh sé go mbeadh uas-aois leagtha síos in airteagail chomhlachais an chomhlacht
